Repository: pypi-data/pypi-mirror-292
Catalog: packages/audiometry-trainer/audiometry_trainer-0.1.16.tar.gz/audiometry_trainer-0.1.16/audiometry_trainer/doc/locale/*/LC_MESSAGES/intro.po
Languages: fr

source: ``audiometry_trainer`` is a software for practicing clinical audiometry. The software simulates patient's responses loaded from case files, and allows practicing essential aspects of the procedure including air/bone conduction threshold search and clinical masking. Figure :ref:`fig-audiometry_trainer_screenshot` shows the main window of ``audiometry_trainer``. Online video tutorials are available on `Youtube. <https://www.youtube.com/playlist?list=PLyfCl_MBfnRBWhN_N3IOJ7wGvIZuRXLK4>`_
fr: ``audiometry_trainer`` est un logiciel pour s'entraîner à l'audiométrie clinique. Le logiciel simule les réponses de patients depuis des fichiers de cas et permet de pratiquer des aspects essentiels de la procédure, y compris la recherche de seuil par voie aérienne/osseuse et le masquage clinique. La figure :ref:`fig-audiometry_trainer_screenshot` affiche la fenêtre principale de ``audiometry_trainer``. Des tutoriels vidéo sont disponible sur `Youtube. <https://www.youtube.com/playlist?list=PLyfCl_MBfnRBh7CLE48BeawkZpKODle1X>`_

source: Screenshot of the ``audiometry_trainer`` interface
fr: Capture d'écran de la fenêtre principale de ``audiometry_trainer``

source: At startup ``audiometry_trainer`` selects a random virtual patient case file (you can load other case files from the ``File menu``).
fr: Au démarrage ``audiometry_trainer`` sélectionne de façon aléatoire un fichier de cas de patient virtuel (vous pouvez charger d'autres cas depuis le menu ``Fichier``).

source: File menu
fr: Fichier menu

source: The ``S`` marker in the audiogram window shows the current stimulus frequency and level. The threshold search is more conveniently conducted using the keyboard rather than via mouse button presses. Press the space bar to play the stimulus (the ``Stimulus light`` at the bottom will light up). If the virtual patient heard the stimulus the ``Response light`` on the left side will light up. Use the up/down arrow keys to change the stimulus level. Once you've found the threshold, press the ``T`` key to mark it on the audiogram plot. Use the right/left arrow keys to move to another frequency.
fr: Le marqueur ``S`` affiché dans la fenêtre de l'audiogramme indique la fréquence et le niveau courants du stimulus. C'est plus pratique d'effectuer la recherche du seuil avec le clavier qu'en cliquant sur des boutons avec la souris. Appuyez sur la barre d'espace pour jouer le stimulus (le ``Témoin du stimulus`` en bas s'allumera). Si le patient virtuel a entendu le son le ``Témoin de réponse`` sur la gauche s'allumera. Utilisez les flèches haut/bas du clavier pour changer le niveau du stimulus. Lorsque vous avez trouvé le seuil, marquez-le en appuyant sur la touche ``T`` (de l'anglais "Threshold"). Utilisez les flèches droite/gauche du clavier pour vous déplacer sur une autre fréquence.

source: You can compare the thresholds that you've estimated with the actual expected thresholds by using the ``Show actual thresholds`` checkboxes at the bottom of the left panel. Virtual patients are modeled via psychometric functions and the "actual" thresholds are computed via Monte Carlo simulations: they are the median thresholds obtained over a large number of simulations; 95% confidence intervals can be shown by checking the ``CI`` checkboxes.
fr: Vous pouvez comparer les seuils que vous avez mesuré avec les seuils attendus en cochant les cases sous ``Affichage des vrais seuils`` dans la partie basse du panneau de gauche. Les patients virtuels sont modelés à travers des courbes psychométriques et les "vrais" seuils sont calculés à travers des méthodes de Monte-Carlo : ils sont les seuils médians obtenus sur un large nombre de simulations ; des intervalles de confiance de 95% peuvent être affichés en cochant les cases ``CI``.

source: You can move from right to left ear and from air to bone conduction stimulation by selecting the desired options in the drop-down menus for ``Channel 1`` at the top of the left panel. ``Channel 2`` is used to deliver masking noise. To turn on ``Channel 2`` check the ``Chan. 2 ON`` check box on the right panel, a ``M`` marker on the audiogram window will indicate the masking noise level. You can use the ``Chan. 2 level`` box and the up/down arrows on its right to set the masker level. You can also ``lock`` the ``Channel 1`` and ``Channel 2`` levels using the ``Lock Channels`` checkbox on the right panel; when the channels are locked increasing/decreasing the stimulus level by a given amount will automatically change the masker level by the the same amount.
fr: Vous pouvez passer de l'oreille droite à la gauche et de la stimulation en conduction aérienne à celle en conduction osseuse en sélectionnant les options souhaitées dans les menus déroulant pour le ``Canal 1`` en haut du panneau de gauche. Le ``Canal 2`` est utilisé pour envoyer du bruit masquant. Pour allumer le ``Canal 2`` cochez la case ``Can. 2 ON`` sur le panneau de droite, un marqueur ``M`` dans la fenêtre de l'audiogramme affichera le niveau courant du bruit masquant. Vous pouvez utiliser la case ``Niveau du can. 2`` ainsi que les flèches haut/bas à sa droite pour saisir le niveau du bruit masquant. Vous pouvez aussi "verrouiller" le ``Canal 2`` au ``Canal 1`` en cochant la case ``Verrouiller les canaux`` sur le panneau de droite : lorsque les canaux sont verrouillés, des augmentations/baisses du niveau du stimulus d'une taille donné déclencheront automatiquement des changements du niveau du masqueur de la même taille.

source: A detailed description of all the features of ``audiometry_trainer`` will be given in the next sections. Section :ref:`sec-installation` tells how to obtain and install ``audiometry_trainer``. Sections :ref:`sec-threshold_search` and :ref:`sec-masking` explain how to perform a threshold search and how to use masking, respectively.
fr: Une description détaillée de toutes les fonctionnalités de ``audiometry_trainer`` sera donne dans les sections suivantes. La Section :ref:`sec-installation` explique comment obtenir et installer ``audiometry_trainer``. Les sections :ref:`sec-threshold_search` and :ref:`sec-masking` expliquent comment faire une recherche de seuil et comment utiliser le masquage, respectivement.

source: ``audiometry_trainer`` uses psychometric functions to model virtual patient responses. Responses are not deterministic (always yes/no above/below a given stimulus level) but probabilistic, with the probability of a response increasing with the stimulus level. This adds realism to the software because in real life the responses of patients are not deterministic. Section :ref:`sec-virtual_listener` details the psychometric function model used by ``audiometry_trainer``.
fr: ``audiometry_trainer`` utilise des courbes psychométriques pour modéliser les réponses des patients virtuels. Les réponses ne sont pas déterministes (toujours oui/non au dessus/dessous d'un certain niveau de stimulation) mais probabilistes, avec une probabilité de réponse croissante en fonction du niveau de stimulation. Cela rends le logiciel plus réaliste car dans la vie réelle les réponses des patients ne sont pas déterministes. La section :ref:`sec-virtual_listener` détaille le modèle de courbe psychométrique utilisé par ``audiometry_trainer``.

source: ``audiometry_trainer`` allows you to create and use your own case files. This functionality can be accessed via the ``Generate case`` button under the ``File menu`` and will be described in detail in Section :ref:`sec-generate_case`. Some knowledge of the psychometric function model used by ``audiometry_trainer`` will be needed to create your own case files.
fr: ``audiometry_trainer`` vous permet de générer et utiliser vous propres fichiers de cas. Vous pouvez accéder à cette fonctionnalité à travers l'action ``Générer un cas`` sous le menu ``Fichier`` et ça sera illustré en détails dans la Section :ref:`sec-generate_case`. Quelques connaissances du modèle de fonction psychométrique utilisé par ``audiometry_trainer`` seront nécessaires pour la création de vos propres fichiers de cas.

source: Section :ref:`sec-user_interface` covers in details all the user interface. Section :ref:`sec-internals` describes some of the internals of the software and is mainly intended for developers rather than for end users.
fr: La Section :ref:`sec-user_interface` couvre en détail toute l'interface utilisateur. La Section :ref:`sec-internals` décrits quelques aspects du fonctionnement interne du logiciel et est adressée aux développeurs plutôt qu'aux utilisateurs du logiciel.
