Repository: pypi-data/pypi-mirror-292
Catalog: packages/audiometry-trainer/audiometry_trainer-0.1.16.tar.gz/audiometry_trainer-0.1.16/audiometry_trainer/doc/locale/*/LC_MESSAGES/virtual_listener.po
Languages: fr

source: Virtual listener
fr: Sujet virtuel

source: The responses of the virtual listener are determined by a psychometric function (PF) that represents the proportion of "Yes" (I heard a sound) responses as a function of stimulus level. A logistic function ([KussEtAl2005]_; [KingdomAndPrins2016]_) is used:
fr: Les réponses du sujet virtuel sont déterminées à partir d'une courbe psychométrique (CP) qui représente la proportion de réponses "Oui" (j'ai entendu un son) en fonction du niveau du stimulus. Une fonction logistique ([KussEtAl2005]_; [KingdomAndPrins2016]_) est utilisée :

source: where :math:`\alpha` is the midpoint, :math:`\beta` the slope, :math:`\gamma` the lower asymptote, and :math:`\lambda` the upper asymptote of the PF; :math:`x` is the stimulus level at which the function is evaluated.
fr: où :math:`\alpha` est le point médian, :math:`\beta` la pente, :math:`\gamma` l'asymptote inférieur, et :math:`\lambda` l'asymptote supérieur de la CP; :math:`x` est le niveau du stimulus auquel la fonction est évaluée.

source: Figure :ref:`fig-logistic_psy` shows some examples of logistic PFs representing the proportion of a "Yes" response as a function of stimulus level. All four panels show the same PF in black together with a function in a different color that has A) a different midpoint, B) a different slope and hence a different width, C) a different lower asymptote, or D) a different upper asymptote. The vertical lines in A) denote the midpoints of the functions, while in B) they denote the "width" from 5% to 95% of "Yes" responses for the two functions. The horizontal dotted lines in all panels denote the probability of correct responses at the midpoint, note that this changes in C) and D) as a function of the asymptote.
fr: La figure :ref:`fig-logistic_psy` montre des exemples de CPs logistiques qui représentent la proportion de réponses "Oui" en fonction du niveau du stimulus. Tous les quatre panneaux affichent la même CP en noise avec une CP de couleur différent qui a A) un point médian différent, B) une pente, et ainsi une largeur, différentes, C) un asymptote inférieur différent, ou D) un asymptote supérieur différent. Les lignes verticales dans A) marquent les points médians des courbes, tandis que dans B) elle masquent la "largeur" de 5% à 95% de réponses "Oui" pour les deux courbes. Les lignes horizontales en pointillé marquent dans tous les panneaux la proportion de réponses correctes au point médian, veillez noter que cela change dans C) et D) en fonction de l'asymptote.

source: Logistic psychometric functions
fr: Courbes psychométriques logistiques

source: The midpoint is the stimulus level at which the PF reaches half of its amplitude, so for a virtual listener with :math:`\gamma = 0` and :math:`\lambda=0`, the midpoint :math:`\alpha` is the stimulus level at which the listener gives (on the long run) 50% of "Yes" responses. The Hughson-Westlake procedure declares the threshold as the lowest point at which the listener gives at least 50% "Yes" responses (over at least 3 trials). Therefore, the threshold (as defined with the Hughson-Westlake procedure) will be generally found at or above the midpoint :math:`\alpha` [MarshallAndJesteadt1986]_. Obviously it is possible that on occasion the threshold will be found at a lower level because the proportion of "Yes" responses found over a small number of trials may differ from the proportion of "Yes" responses expected over the long run.
fr: Le point médian est le niveau du stimulus auquel la CP atteigne la moitié de son amplitude, donc pour un sujet virtuel avec :math:`\gamma = 0` and :math:`\lambda=0`, le point médian :math:`\alpha` est le niveau du stimulus auquel le sujet donne (sur la longue durée) 50% de réponses "Oui". La procédure Hughson-Westlake défini le seuil comme le point le plus bas auquel le sujet donne au moins 50% de réponses "Oui" (sur au moins 3 essais). Par conséquent, le seuil (comme défini avec la procédure Hughson-Westlake) se situera généralement à un point égal ou supérieur du point médian :math:`\alpha` [MarshallAndJesteadt1986]_. C'est tout à fait possible que occasionnellement un seuil soit mesuré à un niveau plus bas que ça car la proportion de réponses "Oui" qu'on retrouve sur un petit nombre d'essais peut être bien différente que la proportion de réponses "Oui" qui sont attendues sur le long terme.

source: The slope :math:`\beta` controls the speed at which the PF goes from its lowest to its highest value as the stimulus level increases. Rather than reasoning in terms of slope, it is often more intuitive to reason in terms of "width" of the PF ([Alcalá-QuintanaAndGarcía-Pérez2004]_; [KussEtAl2005]_), which is inversely correlated with the slope. ``audiometry_trainer`` asks the user the desired 90% width of the PF in order to generate case files. For example, a width of 5 dB indicates that the function (for a virtual listener with :math:`\gamma = 0` and :math:`\lambda=0`) goes from 5% to 95% probability of a "Yes" response within a change in stimulus level of 5 dB.
fr: La pente :math:`\beta` règle la vitesse à laquelle la CP augmente de sa valeur la plus basse à la plus haute avec l'augmenter du niveau du stimulus. Plutôt de raisonner en termes de pente c'est souvent plus intuitif de raisonner en termes de la "largeur" de la CP ([Alcalá-QuintanaAndGarcía-Pérez2004]_; [KussEtAl2005]_), qui est corrélée de façon inverse à la pente. ``audiometry_trainer`` requiert de l'utilisateur la largeur à 90% désirée de la CP pour la génération de fichiers de cas. Par exemple, une largeur de 5 dB indique que la fonction (pour un sujet virtuel avec :math:`\gamma = 0` and :math:`\lambda=0`) varie d'une probabilité de réponse "Oui" de 5% à 95% avec un changement du niveau du stimulus de 5 dB.

source: The lower asymptote, :math:`\gamma`, represents the propensity of the listener to respond "Yes", even in the absence of a stimulus. This propensity is not formally measured in the clinical audiometry procedure [Barr-HamiltonEtAl1969]_ [MarshallAndJesteadt1986]_. In a Yes/No task with temporally marked trials, in which a signal is presented or not, it would correspond to the false alarm rate. For example, a listener with a :math:`\gamma` of 0.1 would respond "Yes" in 1 out of 10 trials in which no stimulus was presented. Under the perspective of signal detection theory this propensity of the listener to say "Yes" reflects an internal criterion which can be more or less conservative. Although the actual measurement of :math:`\gamma` requires "blank" trials without a signal, the criterion determines the decision process also when a signal is present, hence the value of :math:`\gamma` will affect the PF underlying the clinical audiometry procedure.
fr: L'asymptote inférieur, :math:`\gamma`, représente la tendance du sujet à répondre "Oui", même en l'absence de stimulation. Cette tendance n'est pas mesurée de façon formelle dans l'audiométrie clinique [Barr-HamiltonEtAl1969]_ [MarshallAndJesteadt1986]_. Dans une tâche de type Oui/Non avec des essais marqués temporellement, dans lesquels un signal est présenté ou pas, elle serait équivalente au taux de fausses alarmes. Par exemple, un sujet avec un :math:`\gamma` de 0.1 répondrait "Oui" dans 1 fois sur 10 dans des essais dans lesquels il n'y avait pas de stimulation. Sous la perspective de la théorie de la détection du signal cette tendance à répondre "Oui" traduit un critère interne qui peut être plus ou moins prudent. Bien que l'estimation de :math:`\gamma` nécessite des essais sans signal, ce critère détermine le processus de décision aussi quand un signal est présent, donc la valeur de :math:`\gamma` aura une influence sur la CP sous-jacente la procédure d'audiométrie clinique.

source: The upper asymptote, :math:`\lambda` is the lapse rate, it represents the tendency of the listener to fail responding because of attentional lapses, even for a stimulus that is clearly audible.
fr: L'asymptote supérieur, :math:`\lambda`, est le taux d'inattention ; il représente la tendance du sujet à rater des réponses à cause de manques d'attention, même pour un stimulus qui est clairement audible.

source: When performing clinical masking with ``audiometry_trainer``, the effect of the noise is to shift the midpoint of the PF, *if* the noise level arriving at the cochlea, in dB of effective masking (EM) units, exceeds the midpoint of the PF. The shift is equal to the level by which the noise exceeds the midpoint. For example, if the noise level is 5 dB above the unmasked midpoint, the masked midpoint will be 5 dB higher.
fr: Lors du masquage clinique avec ``audiometry_trainer``, l'effet du bruit est de déplacer le point médian de la CP, *si* le niveau du bruit qui arrive à la cochlée, en dB de masquage effectif ("effective masking"; EM), dépasse le point médian de la CP. Le déplacement est égal au niveau par lequel le bruit dépasse le point médian. Par exemple, si le niveau du bruit est 5 dB au dessus du point médian non masqué, le point médian masqué sera 5 dB plus haut.

source: Because the effect of the noise varies between listeners, another variable ``msk_diff`` causes a further shift to the PF midpoint in the presence of noise. ``msk_diff`` is randomly drawn from a Normal distribution with a mean of 0 and a standard deviation of 3 for each frequency/ear combination when case files are generated. These values reflect the fact that interindividual differences in the effectiveness of the masking noise will be in the range of ~10 dB (this is the reason why a 10 dB safety pad is typically added to calculated noise levels in masking formulas). It should be noted that ``msk_diff`` can be either positive or negative. A positive ``msk_diff`` means that the masking effect is greater than average (the PF midpoint is shifted upward), while a negative ``msk_diff`` means that the masking effect is smaller than average (the PF midpoint is shifted downward).
fr: L'efficacité du bruit de masquage varie entre sujets ; pour cette raison une autre variable, ``msk_diff``, produit un déplacement ultérieur du point médian de la CP dans la présence de bruit. ``msk_diff`` est tiré de façon aléatoire d'une distribution Normale avec une moyenne de 0 et une déviation standard de 3 pour chaque combinaison de fréquence/oreille lorsque des fichiers de cas sont générés. Ces valeurs sont basés sur l'observation que les différences dans l'efficacité du bruit de masquage sont de l'ordre d'environ 10 dB (cela est la raison pour laquelle une marge de sécurité de 10 dB est généralement ajoutée pour le calcul du niveau de bruit dans les formules de masquage). Il faut remarquer que ``msk_diff`` peut être une valeur soit positive, soit négative. Une valeur de ``msk_diff`` positive signifie que l'effet de masquage est plus grand de l'effet moyen (le point médian de la CP est déplacé vers le haut), tandis qu'une valeur négative de ``msk_diff`` indique que l'effet de masquage est plus petit de l'effet moyen (le point médian de la CP est déplacé vers le bas).
